# Контрольная работа №3
## Циклы

### В каком порядке должны быть выполнены перечисленные ниже строки кода, чтобы после его выполнения на экран вывелись следующие числа:
#### 5 3 1 -1 -3 -5 -7

1. while(k>=-7){
2. printf("%d", k);
3. int k = 5;
4. k-=2;
5. }
   
### Что будет выведено на экран при выполнении следующего фрагмента программы:

     int i = 2;
     do{
        printf("%3d", i);
        i+=3;
     } while (i<=20)


### Чему будет равно значение переменной i после выполнения следующего фрагмента программы: 

     int i = 1;
     int x = 10;
     for (size_t j = 0; j < x; j++)
     {
       printf("i = %d", i);
       printf("j = %d", j);
     }
